# Room Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..Room Property
Space Class See Also
---
Return the Room of the space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Room Room { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Room As Room
	Get
```

Visual C++
---
```text
public:
property Room^ Room {
	Room^ get ();
}
```

# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace